# UniqueId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..UniqueId Property
Subelement Class See Also
---
A stable unique identifier for this subelement within the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string UniqueId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UniqueId As String
	Get
```

Visual C++
---
```text
public:
property String^ UniqueId {
	String^ get ();
}
```

# See Also
Subelement Class
Autodesk.Revit.DB Namespace